; domain
; IPC5 Domain: Trucks Propositional
; Authors: Yannis Dimopoulos, Alfonso Gerevini and Alessandro Saetti 

(define (domain Trucks) 
(:requirements :typing :adl)  

(:types truckarea time location locatable - object
        truck package - locatable) 

(:predicates (at ?x - locatable ?l - location) 	     
             (in ?p - package ?t - truck ?a - truckarea) 	     
             (connected ?x ?y - location)
             (free ?a - truckarea ?t - truck)
  	     (time-now ?t - time)
 	     (next ?t1 - time ?t2 - time)
	     (le ?t1 - time ?t2 - time)
 	     (delivered ?p - package ?l - location ?t - time)
	     (at-destination ?p - package ?l - location)
 	     (closer ?a1 - truckarea ?a2 - truckarea))

(:action load
 :parameters (?p - package ?t - truck ?a1 - truckarea ?l - location)
 :precondition (and (at ?t ?l) (at ?p ?l) (free ?a1 ?t)
  		    (forall (?a2 - truckarea)
  			    (imply (closer ?a2 ?a1) (free ?a2 ?t))))
 :effect (and (not (at ?p ?l)) (not (free ?a1 ?t)) (in ?p ?t ?a1)))

(:action unload
 :parameters (?p - package ?t - truck ?a1 - truckarea ?l - location)
 :precondition (and (at ?t ?l) (in ?p ?t ?a1)
  		    (forall (?a2 - truckarea)
  			    (imply (closer ?a2 ?a1) (free ?a2 ?t))))
 :effect (and (not (in ?p ?t ?a1)) (free ?a1 ?t) (at ?p ?l)))

(:action drive
 :parameters (?t - truck ?from ?to - location ?t1 ?t2 - time)
 :precondition (and (at ?t ?from) (connected ?from ?to) 
		    (time-now ?t1) (next ?t1 ?t2))
 :effect (and (not (at ?t ?from)) (not (time-now ?t1)) 
	      (time-now ?t2) (at ?t ?to)))

(:action deliver
 :parameters (?p - package ?l - location ?t1 ?t2 - time)
 :precondition (and (at ?p ?l) (time-now ?t1) (le ?t1 ?t2))
 :effect (and (not (at ?p ?l)) (delivered ?p ?l ?t2) (at-destination ?p ?l)))

)

; problem
; Domain designed by Yannis Dimopoulos, Alfonso Gerevini and Alessandro Saetti
; This file has been automatically generated by the generator available from
; http://zeus.ing.unibs.it/ipc-5/generators/index.html

(define (problem truck-67)
(:domain Trucks)
(:objects
	truck1 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	l1 - location
	l2 - location
	l3 - location
	l4 - location
	l5 - location
	l6 - location
	t0 - time
	t1 - time
	t2 - time
	t3 - time
	t4 - time
	t5 - time
	t6 - time
	t7 - time
	t8 - time
	t9 - time
	t10 - time
	t11 - time
	t12 - time
	t13 - time
	t14 - time
	t15 - time
	t16 - time
	t17 - time
	t18 - time
	a1 - truckarea
	a2 - truckarea)

(:init
	(at truck1 l6)
	(free a1 truck1)
	(free a2 truck1)
	(closer a1 a2)
	(at package1 l6)
	(at package2 l6)
	(at package3 l6)
	(at package4 l6)
	(at package5 l4)
	(connected l1 l2)
	(connected l1 l3)
	(connected l1 l4)
	(connected l1 l5)
	(connected l1 l6)
	(connected l2 l1)
	(connected l2 l3)
	(connected l2 l4)
	(connected l2 l5)
	(connected l2 l6)
	(connected l3 l1)
	(connected l3 l2)
	(connected l3 l4)
	(connected l3 l5)
	(connected l3 l6)
	(connected l4 l1)
	(connected l4 l2)
	(connected l4 l3)
	(connected l4 l5)
	(connected l4 l6)
	(connected l5 l1)
	(connected l5 l2)
	(connected l5 l3)
	(connected l5 l4)
	(connected l5 l6)
	(connected l6 l1)
	(connected l6 l2)
	(connected l6 l3)
	(connected l6 l4)
	(connected l6 l5)
	(time-now t0)
	(le t1 t1)
	(le t1 t2)
	(le t1 t3)
	(le t1 t4)
	(le t1 t5)
	(le t1 t6)
	(le t1 t7)
	(le t1 t8)
	(le t1 t9)
	(le t1 t10)
	(le t1 t11)
	(le t1 t12)
	(le t1 t13)
	(le t1 t14)
	(le t1 t15)
	(le t1 t16)
	(le t1 t17)
	(le t1 t18)
	(le t2 t2)
	(le t2 t3)
	(le t2 t4)
	(le t2 t5)
	(le t2 t6)
	(le t2 t7)
	(le t2 t8)
	(le t2 t9)
	(le t2 t10)
	(le t2 t11)
	(le t2 t12)
	(le t2 t13)
	(le t2 t14)
	(le t2 t15)
	(le t2 t16)
	(le t2 t17)
	(le t2 t18)
	(le t3 t3)
	(le t3 t4)
	(le t3 t5)
	(le t3 t6)
	(le t3 t7)
	(le t3 t8)
	(le t3 t9)
	(le t3 t10)
	(le t3 t11)
	(le t3 t12)
	(le t3 t13)
	(le t3 t14)
	(le t3 t15)
	(le t3 t16)
	(le t3 t17)
	(le t3 t18)
	(le t4 t4)
	(le t4 t5)
	(le t4 t6)
	(le t4 t7)
	(le t4 t8)
	(le t4 t9)
	(le t4 t10)
	(le t4 t11)
	(le t4 t12)
	(le t4 t13)
	(le t4 t14)
	(le t4 t15)
	(le t4 t16)
	(le t4 t17)
	(le t4 t18)
	(le t5 t5)
	(le t5 t6)
	(le t5 t7)
	(le t5 t8)
	(le t5 t9)
	(le t5 t10)
	(le t5 t11)
	(le t5 t12)
	(le t5 t13)
	(le t5 t14)
	(le t5 t15)
	(le t5 t16)
	(le t5 t17)
	(le t5 t18)
	(le t6 t6)
	(le t6 t7)
	(le t6 t8)
	(le t6 t9)
	(le t6 t10)
	(le t6 t11)
	(le t6 t12)
	(le t6 t13)
	(le t6 t14)
	(le t6 t15)
	(le t6 t16)
	(le t6 t17)
	(le t6 t18)
	(le t7 t7)
	(le t7 t8)
	(le t7 t9)
	(le t7 t10)
	(le t7 t11)
	(le t7 t12)
	(le t7 t13)
	(le t7 t14)
	(le t7 t15)
	(le t7 t16)
	(le t7 t17)
	(le t7 t18)
	(le t8 t8)
	(le t8 t9)
	(le t8 t10)
	(le t8 t11)
	(le t8 t12)
	(le t8 t13)
	(le t8 t14)
	(le t8 t15)
	(le t8 t16)
	(le t8 t17)
	(le t8 t18)
	(le t9 t9)
	(le t9 t10)
	(le t9 t11)
	(le t9 t12)
	(le t9 t13)
	(le t9 t14)
	(le t9 t15)
	(le t9 t16)
	(le t9 t17)
	(le t9 t18)
	(le t10 t10)
	(le t10 t11)
	(le t10 t12)
	(le t10 t13)
	(le t10 t14)
	(le t10 t15)
	(le t10 t16)
	(le t10 t17)
	(le t10 t18)
	(le t11 t11)
	(le t11 t12)
	(le t11 t13)
	(le t11 t14)
	(le t11 t15)
	(le t11 t16)
	(le t11 t17)
	(le t11 t18)
	(le t12 t12)
	(le t12 t13)
	(le t12 t14)
	(le t12 t15)
	(le t12 t16)
	(le t12 t17)
	(le t12 t18)
	(le t13 t13)
	(le t13 t14)
	(le t13 t15)
	(le t13 t16)
	(le t13 t17)
	(le t13 t18)
	(le t14 t14)
	(le t14 t15)
	(le t14 t16)
	(le t14 t17)
	(le t14 t18)
	(le t15 t15)
	(le t15 t16)
	(le t15 t17)
	(le t15 t18)
	(le t16 t16)
	(le t16 t17)
	(le t16 t18)
	(le t17 t17)
	(le t17 t18)
	(le t18 t18)
	(next t0 t1)
	(next t1 t2)
	(next t2 t3)
	(next t3 t4)
	(next t4 t5)
	(next t5 t6)
	(next t6 t7)
	(next t7 t8)
	(next t8 t9)
	(next t9 t10)
	(next t10 t11)
	(next t11 t12)
	(next t12 t13)
	(next t13 t14)
	(next t14 t15)
	(next t15 t16)
	(next t16 t17)
	(next t17 t18))

(:goal (and 
	(at-destination package1 l1)
	(at-destination package2 l2)
	(at-destination package3 l5)
	(at-destination package4 l2)
	(at-destination package5 l2)))



)

; plan
1. (load package1 truck1 a1 l6)
   deleted: (at package1 l6) (free a1 truck1)
   added: (in package1 truck1 a1)
   goals met: 0 of 5
2. (drive truck1 l6 l1 t0 t1)
   deleted: (at truck1 l6) (time-now t0)
   added: (time-now t1) (at truck1 l1)
   goals met: 0 of 5
3. (unload package1 truck1 a1 l1)
   deleted: (in package1 truck1 a1)
   added: (free a1 truck1) (at package1 l1)
   goals met: 0 of 5
4. (drive truck1 l1 l5 t1 t2)
   deleted: (at truck1 l1) (time-now t1)
   added: (time-now t2) (at truck1 l5)
   goals met: 0 of 5
5. (deliver package1 l1 t2 t10)
   deleted: (at package1 l1)
   added: (delivered package1 l1 t10) (at-destination package1 l1)
   goals met: 1 of 5
6. (drive truck1 l5 l4 t2 t3)
   deleted: (at truck1 l5) (time-now t2)
   added: (time-now t3) (at truck1 l4)
   goals met: 1 of 5
7. (load package5 truck1 a1 l4)
   deleted: (at package5 l4) (free a1 truck1)
   added: (in package5 truck1 a1)
   goals met: 1 of 5
8. (drive truck1 l4 l5 t3 t4)
   deleted: (at truck1 l4) (time-now t3)
   added: (time-now t4) (at truck1 l5)
   goals met: 1 of 5
9. (drive truck1 l5 l2 t4 t5)
   deleted: (at truck1 l5) (time-now t4)
   added: (time-now t5) (at truck1 l2)
   goals met: 1 of 5
10. (unload package5 truck1 a1 l2)
   deleted: (in package5 truck1 a1)
   added: (free a1 truck1) (at package5 l2)
   goals met: 1 of 5
11. (deliver package5 l2 t5 t10)
   deleted: (at package5 l2)
   added: (delivered package5 l2 t10) (at-destination package5 l2)
   goals met: 2 of 5
12. (drive truck1 l2 l5 t5 t6)
   deleted: (at truck1 l2) (time-now t5)
   added: (time-now t6) (at truck1 l5)
   goals met: 2 of 5
13. (drive truck1 l5 l2 t6 t7)
   deleted: (at truck1 l5) (time-now t6)
   added: (time-now t7) (at truck1 l2)
   goals met: 2 of 5
14. (drive truck1 l2 l6 t7 t8)
   deleted: (at truck1 l2) (time-now t7)
   added: (time-now t8) (at truck1 l6)
   goals met: 2 of 5
15. (load package4 truck1 a1 l6)
   deleted: (at package4 l6) (free a1 truck1)
   added: (in package4 truck1 a1)
   goals met: 2 of 5
16. (drive truck1 l6 l2 t8 t9)
   deleted: (at truck1 l6) (time-now t8)
   added: (time-now t9) (at truck1 l2)
   goals met: 2 of 5
17. (unload package4 truck1 a1 l2)
   deleted: (in package4 truck1 a1)
   added: (free a1 truck1) (at package4 l2)
   goals met: 2 of 5
18. (deliver package4 l2 t9 t10)
   deleted: (at package4 l2)
   added: (delivered package4 l2 t10) (at-destination package4 l2)
   goals met: 3 of 5
19. (drive truck1 l2 l6 t9 t10)
   deleted: (at truck1 l2) (time-now t9)
   added: (time-now t10) (at truck1 l6)
   goals met: 3 of 5
20. (load package3 truck1 a1 l6)
   deleted: (at package3 l6) (free a1 truck1)
   added: (in package3 truck1 a1)
   goals met: 3 of 5
21. (drive truck1 l6 l5 t10 t11)
   deleted: (at truck1 l6) (time-now t10)
   added: (time-now t11) (at truck1 l5)
   goals met: 3 of 5
22. (unload package3 truck1 a1 l5)
   deleted: (in package3 truck1 a1)
   added: (free a1 truck1) (at package3 l5)
   goals met: 3 of 5
23. (drive truck1 l5 l2 t11 t12)
   deleted: (at truck1 l5) (time-now t11)
   added: (time-now t12) (at truck1 l2)
   goals met: 3 of 5
24. (deliver package3 l5 t12 t12)
   deleted: (at package3 l5)
   added: (delivered package3 l5 t12) (at-destination package3 l5)
   goals met: 4 of 5
25. (drive truck1 l2 l6 t12 t13)
   deleted: (at truck1 l2) (time-now t12)
   added: (time-now t13) (at truck1 l6)
   goals met: 4 of 5
26. (load package2 truck1 a1 l6)
   deleted: (at package2 l6) (free a1 truck1)
   added: (in package2 truck1 a1)
   goals met: 4 of 5
27. (drive truck1 l6 l2 t13 t14)
   deleted: (at truck1 l6) (time-now t13)
   added: (time-now t14) (at truck1 l2)
   goals met: 4 of 5
28. (unload package2 truck1 a1 l2)
   deleted: (in package2 truck1 a1)
   added: (free a1 truck1) (at package2 l2)
   goals met: 4 of 5
29. (deliver package2 l2 t14 t14)
   deleted: (at package2 l2)
   added: (delivered package2 l2 t14) (at-destination package2 l2)
   goals met: 5 of 5
